Repository: 84000/data-translation-memory
Catalog: toh661-v3.tmx
Source language: bo
Languages: en

source: གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: The Dhāraṇī “The Mother of the Grahas” Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་འབྲོག་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བདུད་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། མིག་དམར་དང་། པ་བ་སངས་དང་། ཕུར་བུ་དང་། གཟའ་ལྷག་དང་། སྤེན་པ་དང་། སྒྲ་གཅན་འཛིན་དང་། མཇུག་རིངས་རྣམས་དང་། རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བརྒྱད་ལ་སོགས་པ་མང་པོ་རྣམས་ཀྱིས་བསྟོད་པ། རྡོ་རྗེ་ཆེན་པོའི་དམ་ཚིག་གིས་བྱིན་གྱིས་བརླབས་ཀྱིས་རྡོ་རྗེའི་ཁྲི་ལ་བཞུགས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་དུ་མ་དང་ཡང་ཐབས་ཅིག་སྟེ། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་གཏུམ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་སྡེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་གཞུ་ཅན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་བདག་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་རྒྱན་དང་།
en: The Blessed One was dwelling in Aṭavika’s great city, where he was being praised by a multitude of devas, nāgas, yakṣas, rākṣasas, gandharvas, asuras, garuḍas kinnaras, and mahoragas as well as Māra, Sūrya, Candra, Aṅgāraka, Śukra, Bṛhaspati, Budha, Śani, Rāhu, Ketu, the twenty-eight nakṣatras, and so forth while seated on a lion throne graced with the ornaments of the great vajra samaya.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་གཟིགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པདྨའི་ཏོག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞལ་རས་རྒྱས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པདྨའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་པདྨའི་སྤྱན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུ་དང་།
en: He was accompanied by a multitude of bodhisattvas and surrounded by a saṅgha of bodhisattvas including the bodhisattva great being Vajrapāṇi, the bodhisattva great being Vajracaṇḍa, the bodhisattva great being Vajrasena, the bodhisattva great being Vajra Bow, the bodhisattva great being Vajra Master, the bodhisattva great being Vajra Ornament, the bodhisattva great being Vajra Light, the bodhisattva great being Noble Avalokiteśvara, the bodhisattva great being Samantadarśin, the bodhisattva great being Lokaśrī, the bodhisattva great being Lotus Flag, the bodhisattva great being Broad Face, the bodhisattva great being Padmagarbha, the bodhisattva great being Lotus Eyes, the bodhisattva great being Mañjuśrīkumāra, the bodhisattva great being Maitreya, and more.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་རྣམས་ཀྱིས་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་པ་ལ་ཆོས་སྟོན་ཏོ། །
en: He sat before them teaching the Dharma.

source: བཀོད་པ་ཆེན་པོའི་རྒྱན་གྱི་ནོར་བུ་ཞེས་བྱ་བ་ཐོག་མར་དགེ་བ་དང་། བར་དུ་དགེ་བ་དང་། ཐ་མར་དགེ་བ་དང་། དོན་བཟང་པོ་དང་། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བའི་ཆོས་སྟོན་ཏོ། །
en: He was giving a Dharma teaching called, “A Jewel Adorning the Great Array” that was good at the beginning, good in the middle, good at the end, excellent in meaning, beautiful in its expression, unadulterated, perfectly pure, and thoroughly erudite.

source: དེ་ནས་ཕྱག་ན་རྡོ་རྗེས་འཁོར་དེ་དག་ལ་བལྟས་ཏེ། ལངས་ནས་རང་གི་རྫུ་འཕྲུལ་གྱི་བྱིན་གྱིས་བརླབས་ཀྱིས། བཅོམ་ལྡན་འདས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་བསྐོར་བ་བྱས་ཏེ་ཕྱག་འཚལ་ནས་སྤྱན་སྔར་འདུག་སྟེ།
en: Then, Vajrapāṇi rose from his seat in the assembly, and, through his own magical power, circled the Blessed one many thousands of times, bowed, and sat before him.

source: སྙེམས་པ་དང་བཅས་པས་སྐྱིལ་མོ་ཀྲུང་ལེགས་པར་བཅས་ནས། འཁོར་དེ་དག་ལ་འགྱིང་བག་ཏུ་བལྟས་ཏེ། རྡོ་རྗེའི་ཐལ་མོ་རང་གི་སྙིང་གར་བཞག་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With pride, he sat in a perfect cross-legged position casting his majestic gaze at the assembly with his vajra palms placed together at his heart, and addressed the Blessed One.

source: བཅོམ་ལྡན་འདས་གཟའ་མི་བཟད་པ། མི་བཟད་པའི་གཟུགས་ཅན།
en: “Blessed One, the grahas are horrible and have a horrible nature.

source: དྲག་ཤུལ་ཅན་དྲག་ཤུལ་གྱི་སེམས་དང་ལྡན་པ།
en: They are fierce and have a fierce disposition.

source: ཁྲོ་བ་ཁྲོ་བའི་གཟུགས་ཅན་དག་སེམས་ཅན་ཐམས་ཅད་ལ་འཚེ་བར་བགྱིད་པ།
en: They are wrathful and have a wrathful nature. They hurt, harm, and steal the life force of beings.

source: ཐོ་འཚམ་པར་བགྱིད་པ། མདངས་ཀྱང་འཕྲོག་པར་བགྱིད་ཅིང་། ཁ་ཅིག་ནོར་ཟས་འཕྲོག་པར་བགྱིད། ཁ་ཅིག་ནི་སྲོག་འཕྲོག་པར་བགྱིད། སེམས་ཅན་ཚེ་རིང་བ་ཁ་ཅིག་ནི་ཚེ་ཐུང་ངུར་བགྱིད་དོ། །
en: Some take wealth, some take life, and some shorten the length of a being’s lifespan.

source: དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ལ་གནོད་ཅིང་འཚེ་བར་བགྱིད་པ་དེ་རྣམས་ཀྱི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་གང་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་བསྲུང་བར་འགྱུར་བ་བཤད་དུ་གསོལ།
en: Since they cause such harm to beings and affect their lifespan, will the Blessed One please teach a Dharma discourse that can be used to protect all beings?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Well done,” the Blessed One responded.

source: གང་ཡང་ཁྱོད་ཀྱིས་སྙིང་རྗེ་བསྐྱེད་པས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་གསང་ཆེན་བས་ཀྱང་ཆེས་གསང་བ་དེ་བཞིན་གཤེགས་པ་ལ་ཞུ་བར་བྱེད་པ་ལེགས་སོ་ལེགས་སོ། །
en: “It is good that the compassion you have generated has led you to ask Thus-Gone One about the most secret of great secret teachings so that it might benefit beings.

source: དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Please listen well and pay attention.

source: གཟའ་མི་བཟད་པའི་གཟུགས་ཅན་ཤིན་ཏུ་ཁྲོ་བ་དང་། ཤིན་ཏུ་འཇིགས་པར་བྱེད་པ་རྣམས་ཀྱིས་མཆོད་པ་དང་། མཆོད་ཡོན་དང་། བཟླས་བརྗོད་བཟང་པོ་གསང་བ་བས་ཀྱང་ཆེས་གསང་བ་ངས་བཤད་དོ། །དེ་དག་མཆོད་པས་མཆོད་གྱུར་ཅིང་། །གནོད་པ་བྱས་ན་གནོད་བྱེད་དང་། །གཟའ་དེ་ཀུན་གྱི་ཁ་དོག་དང་། །ཇི་ལྟ་བུར་ནི་འགྱུར་བ་དང་། །ལྷ་རྣམས་དང་ནི་ལྷ་མིན་དང་། །མིའམ་ཅི་དང་ཀླུ་དག་དང་། །གནོད་སྦྱིན་རྣམས་དང་སྲིན་པོ་དང་། །
en: I will explain the most secret of secret excellent offerings and excellent recitation for incanting offering water for the grahas who have a vicious nature and are so very wrathful and terrifying.

source: མི་རྣམས་དང་ནི་མི་མ་ཡིན། །དྲག་པོ་གཟི་བརྗིད་ཆེན་པོ་དང་། །ཁྲོས་པ་ཞི་བར་བྱེད་པ་དེའི། །གསང་སྔགས་རྣམས་དང་མཆོད་པ་དང་། །རིམ་པ་བཞིན་དུ་བཤད་པར་བྱ། །
en: “I will give a systematic explanation Of worshiping them with the offering rite, Identifying the perpetrator when harm has occurred, The colors of the celestial grahas, “How they can be appeased, And the offerings and mantras That will pacify wrathful Devas, asuras, “Kinnaras, nāgas, Yakṣas, rākṣasas, Humans, and nonhumans Brimming with fierce, fiery energy.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཉིད་ཀྱི་ཐུགས་ཀ་ནས་སྙིང་རྗེ་རྣམ་པར་རོལ་པ་ཞེས་བྱ་བའི་འོད་ཟེར་བཀྱེ་སྟེ། །གཟའ་རྣམས་ཀྱི་སྤྱི་བོར་ཞུགས་སོ། །
en: A radiant light referred to as “the manifestation of compassion” blazed forth from blessed Śākyamuni’s heart and entered the crowns of the grahas.

source: དེ་ནས་དེའི་མོད་ལ་ཉི་མ་ལ་སོགས་པའི་གཟའ་ཐམས་ཅད་ལངས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ལྷ་རྫས་ཀྱི་མཆོད་པ་བྱས་ཏེ། ཕྱག་འཚལ་ནས་པུས་མོ་བཙུགས་ནས་ཐལ་མོ་སྦྱར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བདག་ཅག་ལ་སྨན་ཡོན་བཏགས་པར་གྱུར་ཏོ། །
en: Just then, Sūrya and the rest of the celestial grahas all got up, made a divine offering to the blessed, thus-gone Śākyamuni, bowed, knelt on one knee with their palms together, and addressed the Blessed One: “The blessed, thus-gone, worthy, perfect Buddha has shown us hospitality.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་གང་གིས་བདག་ཅག་རྣམས་ལ་སོགས་པས་ཆོས་སྨྲ་བ་རྣམས་ལ་བསྲུང་བར་འགྱུར་བ་དང་། ཡོངས་སུ་བསྐྱབ་པ་དང་། ཞི་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བ་དང་། མཚོན་ཆ་སྤང་བ་དང་། ཆད་པ་སྤང་བ་དང་། དུག་གཞིལ་བ་དང་། དུག་གསད་པ་དང་། མཚམས་བཅད་པ་དང་། ས་བཅིང་བ་རྣམས་བགྱིད་པར་འགྱུར་བ་བཤད་དུ་གསོལ།
en: Blessed One, please teach a Dharma discourse that will guard and protect Dharma reciters from us and other beings, that will bring them peace and happiness, and that will allow them to dispel weapons, dispel punishment, neutralize poison, nullify poison, create a protective boundary, and bind the ground.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་གཟའ་རྣམས་མཆོད་པ་དང་། གསང་སྔགས་བཀའ་སྩལ་ཏོ། །ཨོཾ་མཻ་གྷོ་ལྐཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་ཤི་ཏཱཾ་ཤ་བེ་སྭཱ་ཧཱ། ཨོཾ་ར་ཀྟཱཾ་ག་ཀུ་མཱ་རཱ་ཡ་སྭཱ་ཧཱ། ཨོཾ་བུ་དྷཱ་ཡ་སྭཱ་ཧཱ། ཨོཾ་བྲྀ་ཧ་སྤ་ཏ་ཡེ་སྭཱ་ཧཱ། །ཨོཾ་ཨ་སུ་རོཏྟ་མཱ་ཡ་སྭཱ་ཧཱ། ཨོྃ་ཀྲྀཥྞ་བརྞྞཱ་ཡ་སྭཱ་ཧཱ། ཨོཾ་ཨ་མྲྀ་ཏ་པྲི་ཡཱ་ཡ་སྭཱ་ཧཱ། ཨོཾ་ཛྱོ་ཏིཥྐེ་ཏ་པཻ་སྭཱ་ཧཱ།
en: The blessed, thus-gone Śākyamuni then pronounced the following mantra for making offerings to the grahas: oṁ maigholkāya svāhā | oṁ śītāṃśave svāhā | oṁ raktāṅgakumārāya svāhā | oṁ budhāya svāhā | oṁ bhṛhaspataye svāhā | oṁ asurottamāya svāhā | oṁ kṛṣṇa­varṇāya svāhā | oṁ amṛtapriyāya svāhā | oṁ jyotiśketave svāhā | “Vajrapāṇi, this is the heart mantra of the celestial grahas.

source: ལག་ན་རྡོ་རྗེ་འདི་དག་ནི་གཟའ་དགུའི་གསང་སྔགས་ཀྱི་སྙིང་པོ་བཀླགས་པས་གྲུབ་པ་ཡིན་ཏེ།
en: Offerings are made just by reciting it.

source: ཁ་དོག་དང་མཐུན་པར་སྤོས་ཀྱིས་དཀྱིལ་འཁོར་སོར་བཅུ་གཉིས་པ་བྱས་པའི་དབུས་སུ་མཆོད་པར་བྱའོ། །ཁམ་པའམ།
en: One should perform the offering in the middle of a maṇḍala that is twelve fingers in diameter and made with the appropriate colored powders.

source: ཟངས་ལ་སོགས་པའམ། གསེར་དང་དངུལ་གྱི་སྣོད་དུ་མཆོད་ཡོན་ཕུལ་ནས། རེ་རེ་ལ་ཡང་བཟླས་བརྗོད་བརྒྱ་རྩ་བརྒྱད་བྱའོ། །
en: Present the water offering in a clay, copper, or other vessel or in a vessel made of silver and gold and incant each one with the mantra one hundred and eight times.

source: ལག་ན་རྡོ་རྗེ་དེའི་འོག་ཏུ་གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་ལན་བདུན་བརྗོད་པར་བྱའོ། །
en: “After that, Vajrapāṇi, one should recite the mantra verses of The Dhāraṇī “The Mother of the Grahas” seven times.

source: དེ་ནས་གཟའ་རྣམས་ཐམས་ཅད་སྲུང་བ་བྱེད་པར་འགྱུར་རོ། །དབུལ་བའི་གདོན་ལས་ཐར་བར་འགྱུར་རོ། །
en: All the grahas will offer their protection, and one will be free from grahas who cause poverty.

source: ཚེ་ཟད་པ་ལས་ཚེ་རིང་པོར་བྱེད་པར་འགྱུར་རོ། །
en: They will extend one’s lifespan after one’s lifespan has been exhausted.

source: ལག་ན་རྡོ་རྗེ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དང་། གཞན་ཡང་སེམས་ཅན་གྱི་རིགས་གང་ཡིན་པ་དང་། གང་དག་གི་རྣ་ལམ་དུ་གྲགས་པ་དེ་དག་ཀྱང་དུས་མ་ཡིན་པར་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར་རོ། །
en: Vajrapāṇi, any monk, nun, male lay practitioner, female lay practitioner, or any other type of being who hears it will not suffer an unnatural death.

source: ཕྱག་ན་རྡོ་རྗེ་གཟའ་རྣམས་ཀྱི་དཀྱིལ་འཁོར་གྱི་དབུས་སུ་མཆོད་པར་བྱ་སྟེ།
en: “Vajrapāṇi, one should perform the following offering in the middle of the maṇḍala of the celestial grahas.

source: ཉིན་གཅིག་བཞིན་དུ་ཀློག་པར་བྱེད་པའི་ཆོས་སྨྲ་བ་གང་ཡིན་པ་དེ་ལ་གཟའ་ཐམས་ཅད་བདག་ཉིད་ཀུན་གྱིས་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ། །
en: The celestial grahas themselves will fulfill every wish for the dharma reciter who recites it every day.

source: དེ་དང་རིགས་གཅིག་པ་རྣམས་ཀྱི་དབུལ་བ་ཡང་སེལ་བར་བྱེད་དོ། །
en: One’s impoverished state and the destitution of one’s family will be brought to an end.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བ་བཀའ་སྩལ་པ། སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ། །
en: Then, the blessed, thus-gone one Śākyamuni pronounced The Mother of the Grahas: “Homage to the buddhas.

source: རྡོ་རྗེ་འཆང་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to Vajradhara.

source: པདྨ་འཆང་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to Padmadhara.

source: བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་གཟའ་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the celestial grahas who fulfill every wish.

source: རྒྱུ་སྐར་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the nakṣatras.

source: གཟའ་ཁྱིམ་བཅུ་གཉིས་པོ་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །ཏ་དྱ་ཐཱ། བུདྡྷེ་བུདྡྷེ། བཛྲེ་བཛྲེ། པདྨེ་པདྨེ། ས་ར་ས་ར། པྲ་ས་ར་པྲ་ས་ར། སྨ་ར་སྨ་ར། ཀྲཱི་ཌ་ཡ་ཀྲཱི་ཌ་ཡ། མཱ་ར་ཡ་མཱ་ར་ཡ། མཱརྡྷ་ཡ་མཱརྡྷ་ཡ། གྷཱ་ཏ་ཡ་གྷཱ་ཏ་ཡ། སརྦ་བིགྷྣཱ་ན། ཀུ་རུ་ཀུ་རུ། ཙྪིནྡྷ་ཙྪིནྡྷ། བྷིནྡ་བྷིནྡ།
en: Homage to the twelve houses of the celestial grahas.

source: ཀྵཱ་པ་ཡ་ཀྵཱ་པ་ཡ། ཤཱནྟེ་ཤཱནྟེ། དཱནྟེ་དཱནྟེ། དཱ་མ་ཡ་དཱ་མ་ཡ། བཅོམ་ལྡན་འདས་མ་བདག་ཉིད་མྱུར་དུ་བསྟན་དུ་གསོལ།
en: tadyathā | oṁ buddhe buddhe vajre vajre padme padme sara sara prasara prasara smara smara krīḍaya krīḍaya māraya māraya mārdhaya mārdhaya ghātaya ghātaya sarvavighnān kuru kuru cchindha cchindha bhinda bhinda kṣāpaya kṣāpaya śānte śante dānte dānte dāmaya dāmaya Quick, Blessed Lady, please reveal yourself to me!

source: བདག་འཁོར་དང་བཅས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བསྲུང་དུ་གསོལ།
en: Please protect me, my retinue, and all beings.

source: བསྲུང་དུ་གསོལ། གཟའ་ཐམས་ཅད་དང་། རྒྱུ་སྐར་རྣམས་ཀྱི་གནོད་པ་བཟློག་ཏུ་གསོལ། བཅོམ་ལྡན་འདས་མ་རྫུ་འཕྲུལ་ཆེན་པོ་མངའ་བ་སྡང་བའི་སེམས་ཅན་རྣམས་བསལ་དུ་གསོལ།
en: Please protect us.

source: བདག་གི་སྡིག་པ་རྣམས་སྐམ་དུ་གསོལ། །ཙཎྜེ་ཙཎྜེ། ཏུ་རུ་ཏུ་རུ། ཙཎྜེ་ནི་ཙཎྜེ་ནི། མུ་ཡུ་མུ་ཡུ། མུ་ཙུ་མུ་ཙུ། བ་ཧ་བ་ཧ། ཨུ་གྲེ་ཨུ་གྲ་ཏ་མེ། པཱུ་ར་ཡ་མེ། མ་ནོར་ཐཾ་པ་རི་པཱུ་ར་ཡ། སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་དྷིཥྛི་ཏེ་ས་མ་ཡེ་སྭཱ་ཧཱ། ཨོྃ་སྭཱ་ཧཱ། ཧཱུྃ་སྭཱ་ཧཱ། ཧྲཱི་སྭཱ་ཧཱ། དྷྲྃ་སྭཱ་ཧཱ། དྷྲྀཾ་སྭཱ་ཧཱ། པདྨ་དྷ་རཱ་སྭཱ་ཧཱ། ཨཱ་དི་ཏྱཱ་ཡ་སྭཱ་ཧཱ། སཽ་མཱ་ཡ་སྭཱ་ཧཱ། དྷཱ་ར་ཎཱི་སུ་ཏཱ་ཡ་སྭཱ་ཧཱ། བུདྷཱ་ཡ་སྭཱ་ཧཱ། བྲྀ་ཧསྤ་ཏ་ཡེ་སྭཱ་ཧཱ། ཤུ་ཀྲཱ་ཡ་སྭཱ་ཧཱ། ཀྲྀཥྞ་བརྞྞ་ཡ་སྭཱ་ཧཱ། རཱ་ཧ་བེ་སྭཱ་ཧཱ། ཀེ་ཏ་བེ་སྭཱ་ཧཱ།
en: Please dispel the harmful influences of all grahas and nakṣatras.

source: བུདྡྷ་ཡ་སྭཱ་ཧཱ། བཛྲ་དྷ་རཱ་ཡ་སྭཱ་ཧཱ། པདྨ་དྷ་རཱ་ཡ་སྭཱ་ཧཱ། ཀུ་མཱ་རཱ་ཡ་སྭཱ་ཧཱ། སརྦ་གྲ་ཧེ་བྷྱཿསྭཱ་ཧཱ། སརྦ་ནཀྵ་ཏྲེ་བྷྱཿསྭཱ་ཧཱ།
en: Blessed Lady with great magical power, please clear away all wicked beings and please dry up my own misdeeds caṇḍe caṇḍe turu turu caṇḍani caṇḍani muyu muyu mucu mucu vaha vaha ugre ugrata me pūraya me manoratham paripūraya sarvatathāgatādhiṣṭhite samaye svāhā | oṁ svāhā | hūṁ svāhā | hrī svāhā | dhruṁ svāhā | dhriṁ svāhā | padmadharāya svāhā | ādityāya svāhā | saumāya svāhā | dhāraṇīsutāya svāhā | budhāya svāhā | bṛhaspataye svāhā | śukrāya svāhā | kṛṣṇavarṇāya svāhā | rahāve svāhā | ketave svāhā | buddhāya svāhā | vajradharāya svāhā | padmadharāya svāhā | kumārāya svāhā | sarvagrahebhyaḥ svāhā | sarvanakṣatrebhyaḥ svāhā | sarvadvādaśarāśinibhyaḥ svāhā | sarvopadravebhyaḥ svāhā | oṁ sarvavidye hūṁ hūṁ phaṭ phaṭ svāhā | “Vajrapāṇi, the mantra verses of The Dhāraṇī “The Mother of the Grahas” are the foundation of all of the siddhis.

source: སརྦ་དྭཱ་ད་ཤ་རཱ་ཤི་ནི་བྷྱཿསྭཱ་ཧཱ། སརྦ་ཨུ་པ་དྲ་བེ་བྷྱཿསྭཱ་ཧཱ། ཨོཾ་སརྦ་བིདྱེ་ཧཱུྃ་ཧཱུྃ་ཕཊ་ཕཊ་སྭཱ་ཧཱ། ཕྱག་ན་རྡོ་རྗེ་འདི་ནི་གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་དངོས་གྲུབ་ཐམས་ཅད་ཀྱི་གཞི་ཡིན་ནོ། །ཕྱག་ན་རྡོ་རྗེ་གང་ཡང་གཟའ་རྣམས་ཀྱི་གཟུངས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྟོན་ཟླ་ཐ་ཆུངས་ཡར་གྱི་ངོའི་ཚེས་བདུན་ནས་བརྩམས་ཏེ་གསོ་སྦྱོང་དང་ལྡན་པར་བྱས་ཏེ།
en: Vajrapāṇi, the recitation of these mantra verses of The Dhāraṇī “The Mother of the Grahas” should begin on the seventh day during the waxing moon in the autumnal month of Kārtika.

source: ཚེས་བཅུ་བཞིའི་བར་དུ་གཟའ་རྣམས་ལ་མཆོད་པ་བྱས་ཏེ་གཟུང་བར་བྱའོ། །
en: One should continue to take temporary vows and make offerings to the grahas until the fourteenth day of the month.

source: དེ་ནས་ཟླ་བ་ཉའི་ཉིན་མཚན་ཐོག་ཐག་བཀླགས་ན་དེ་དག་ལ་ལོ་དགུའི་བར་འཆི་བའི་འཇིགས་པ་མི་འབྱུང་ངོ་། །
en: If one recites it day and night during the full moon, one will not have to fear death for ninety-nine years.

source: གཟའི་འཇིགས་པ་དང་། སྐར་མདའ་ལྟུང་བ་དང་། རྒྱུ་སྐར་གྱི་གནོད་པས་འཇིགས་པར་མི་འགྱུར་རོ། །
en: One will not fear perils caused by grahas or harm caused by meteors and nakṣatras.

source: ཚེ་རབས་དྲན་པར་འགྱུར་རོ། །
en: One will remember one’s past lives.

source: གཟའ་ཐམས་ཅད་ལ་མཆོད་པ་བྱས་པར་འགྱུར་རོ། །གཟའ་ཐམས་ཅད་ཀྱིས་ཅི་འདོད་པ་སྦྱིན་པར་བྱེད་དོ། །
en: The grahas will worship them and give them whatever they want.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་གཟའ་རྣམས་ཀྱིས་ཕྱག་འཚལ་ཏེ།
en: After that, the celestial grahas bowed to the Blessed One, expressed their approval, and disappeared.

source: ལེགས་སོ་ལེགས་སོ་ཞེས་གསོལ་ཏེ་མི་སྣང་བར་གྱུར་ཏོ། གཟའ་རྣམས་ཀྱི་ཡུམ་ཞེས་བྱ་བའི་གཟུངས་རྫོགས་སོ།།
en: This concludes The Dhāraṇī “The Mother of the Grahas.”
